pet-api/app/controllers/clinics_controller.rb

SELECT "clinics".* FROM "clinics" WHERE "clinics"."id" = ? LIMIT ?  [["id", 42], ["LIMIT", 1]]
---
    def show
        clinic = Clinic.find(params[:id])

SELECT "clinics".* FROM "clinics"
---
    def index
        clinics = Clinic.all