pet-api/app/controllers/owners_controller.rb

INSERT INTO "owners" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "neben"], ["email", "sdfsafdsfa"], ["created_at", "2021-06-26 22:12:06.851181"], ["updated_at", "2021-06-26 22:12:06.851181"]]
---
    def create
        @owner = Owner.new(owner_params)
        @owner.save

SELECT "owners".* FROM "owners"
---
    def index
        owners = Owner.all

DELETE FROM "owners" WHERE "owners"."id" = ?  [["id", 4]]
---
    def destroy
        @owner.destroy