pet-api/app/controllers/pets_controller.rb

SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        pet = Pet.find(params[:id])

SELECT "pets".* FROM "pets"
---
    def index
        pets = Pet.all